{
  "cars": [
    {
      "id": 1,
      "imgUrl": "https://www.auto-press.net/gallery/article/images_big/gallery_picture_0376788001390286021.jpg",
      "brand": "Opel",
      "model": "Meriva",
      "year": 2018,
      "color": "Red",
      "description": "Power comes from a lovely 1.4-litre turbocharged engine boasting 103 kW and 200 Nm of torque. Those figures will sound familiar if you’re an Opel fan, as this is the same engine which can be found under the bonnet of the Opel Astra GTC coupe – a car which I particularly enjoyed driving. The engine is smooth and there’s no hesitation when you want to overtake. Power is sent from the engine to the front wheels via a typically Opel solid and clunky six-speed gearbox. It’s interesting to note that Opel isn’t offering an automatic derivative for this model as I’d assume most customers would appreciate the ease of use. Despite its 1.4-litre size, the Opel Meriva is a little thirstier than expected. Our test route to Cape Point and back saw a figure of 8.2 l/100km."
    },
    {
      "id": 2,
      "imgUrl": "https://imgd.aeplcdn.com//642x361//n/cw/ec/152081/bmw-i7-right-front-three-quarter4.jpeg?",
      "brand": "BMW",
      "model": "I7 Gran Coupe",
      "year": 2024,
      "color": "Brown",
      "description": "The BMW i7 has two new trim levels for 2024: the now standard i7 eDrive50 and the top-of-the-line i7 M70. These trims are positioned above and below the existing i7 xDrive60 trim. The eDrive50 offers a single electric motor with rear-wheel drive, a lower starting MSRP of $105,700*, and the most range of all i7 models with up to 321 miles. The M70 is the new, performance-focused trim with dual motor all-wheel drive and 650 horsepower, starting at $168,500*."
    },
    {
      "id": 3,
      "imgUrl": "https://imgd.aeplcdn.com/664x374/n/cw/ec/22803/audi-q7-facelift-exterior-1.jpeg",
      "brand": "Audi",
      "model": "Q5",
      "year": 2022,
      "color": "White",
      "description": "Comfortable, capable, and quick, the Audi Q7 is one of the best luxury SUVs on the market, a distinction we made official by awarding it two straight 10Best Trucks and SUVs awards. Our long-term example arrived after the first trophy was handed out for 2017—the first year for the second-generation Q7, which improved upon its predecessor without abandoning its best attributes. Crucially, the current Q7 shed noticeable mass while retaining its family-friendly seven-passenger seating configuration and standard Quattro all-wheel drive. A standard 252-hp turbocharged 2.0-liter inline-four now opens the Audi’s lineup, but we opted to spend 40,000 miles with the available 333-hp supercharged 3.0-liter V-6 with up to 7700 pounds of towing capacity. A smooth-shifting eight-speed automatic transmission is standard across the board."
    },
    {
      "id": 4,
      "imgUrl": "https://prod.pictures.autoscout24.net/listing-images/3e0c4a9e-d41b-4a93-8c2a-1277d0bae616_e8ccec1f-ebf3-4a3d-8b02-c948c000d474.jpg",
      "brand": "Toyota",
      "model": "Corolla",
      "year": 2023,
      "color": "Brown",
      "description": "The 12th-generation Toyota Corolla offers impressive fuel efficiency and an abundance of standard safety features in a compact package that looks far more exciting than it is to drive. The most powerful Corolla gets a four-cylinder engine with a mere 169 horsepower that fails to accelerate the car with any verve. For 2017, the Corolla gets updated front styling and new standard features, like a backup camera. There are new standard active safety features, too, including forward pre-collision warning with pedestrian detection, automatic emergency braking, lane departure warning and prevention, automatic high-beam headlights and adaptive cruise control."
    },
    {
      "id": 5,
      "imgUrl": "https://contentmonster.ru/data/tmp/export/64i5bd6dba8c00690.42094799.jpg",
      "brand": "Ford",
      "model": "Escort",
      "year": 2017,
      "color": "Dark red",
      "description": "An underpowered 132-hp 1.8-liter four-cylinder is the standard engine. The LE Eco uses a specially tuned version that makes 140 horsepower and slightly less torque. A continuously variable automatic transmission (CVT) is standard equipment; a six-speed manual is optional only on the SE. The All-New Ford Escort makes choosing a car easy. More room allows you to bring along the family, while low fuel consumption lets you to take on more miles. Discover the peace of mind of carrying what you need when you need it with an impressive cargo space. Your safety is always the main priority, which is why it’s been embedded into Escort’s DNA. Affordable spare parts and customizable maintenance plans make this Escort an easy choice for everyone."
    },
    {
      "id": 6,
      "imgUrl": "https://di-uploads-pod18.dealerinspire.com/germainhondaofbeavercreek/uploads/2023/02/2023Accord1.jpg",
      "brand": "Honda",
      "model": "Accord",
      "year": 2023,
      "color": "Black",
      "description": "The 2023 Honda Accord is an All-New midsize sedan featuring a highly responsive 192-HP turbocharged engine and an available 204-HP hybrid powertrain for remarkable gas mileage and improved acceleration. The latest Accord is a solid choice for a family sedan. It's roomy, practical and easy to drive. It's also impressively fuel-efficient if you get the hybrid powertrain. But some of the Accord's newest tech and features are exclusively available on the top trim level, the Touring. Unless you're willing to shell out for a fully loaded model, the Accord just doesn't stand out in the class like it used to."
    },
    {
      "id": 0.6571110850981867,
      "imgUrl": "https://cms.groupeditors.com/img/autodealer/3846_1.jpg",
      "brand": "Volkswagen",
      "model": "Golf GT1",
      "color": "Red",
      "year": 2021,
      "description": "The original Golf Mk1 was a front-engined, front-wheel drive replacement for the air-cooled, rear-engined, rear-wheel drive Volkswagen Beetle. Historically, the Golf is Volkswagen's best-selling model and is among the world's top three best-selling models, with more than 35 million units sold as of 2019.\nInitially, most Golfs were 3-door hatchbacks. Other variants include a 5-door hatchback, estate (Variant, from 1993), convertible (Cabriolet and Cabrio, 1979–2002, Cabriolet, 2011–present), and a Golf-based saloon, called the Jetta, Vento (from 1992) or Bora (from 1999). The Golf covers economy to high-performance market segments."
    },
    {
      "id": 0.9439774808637571,
      "brand": "BMW",
      "imgUrl": "https://www.bmwusa.com/content/dam/bmw/common/limited-edition/2024/soc25/m4-cs/BMW-LimitedEdition-M4-CSL-all.jpg.bmwimg.small.jpg",
      "model": "Limited edition",
      "color": "Blue",
      "year": 2023,
      "description": "he 4 Series Coupe M models combine all the sporty style and prolific performance you’ve come to expect from BMW M. With horsepower ranging from 523 in the BMW M440i xDrive Coupe all the way up to 543 in the BMW M4 CS, these performance powerhouses deliver thrilling driving dynamics – both on the road and racetrack."
    }
  ],
  "motorbikes": [
    {
      "id": 1,
      "imgUrl": "https://www.honda.co.uk/content/dam/central/motorcycles/Coming-soon-2024/24ym-coming-soon-hornet-eicma-video-mobile.jpg/_jcr_content/renditions/m_r.jpg",
      "brand": "Honda",
      "model": "CX 500 turbo",
      "year": 2018,
      "color": "Black",
      "description": "The Honda CX series motorcycles, including the GL500 and GL650 Silver Wing variants, were developed and released by Honda in the late 1970s, with production ending in most markets by the mid 1980s. The design included innovative features and technologies that were uncommon or unused at the time such as liquid cooling, electric-only starting, low-maintenance shaft drive, modular wheels, and dual CV-type carburetors that were tuned for reduced emissions. The electronic ignition system was separate from the rest of the electrical system, but the motorcycle could only be started via the start button."
    },
    {
      "id": 2,
      "imgUrl": "https://images.netdirector.co.uk/gforces-auto/image/upload/w_375,h_281,q_auto,c_fill,f_auto,fl_lossy/auto-client/046613bd7faf5ea6a7b80e0ac9c56bbf/bmw_motorrad_new_s_1000_rr_mobile.jpg",
      "brand": "BMW",
      "model": "S 1000 RR",
      "year": 2020,
      "color": "Red",
      "description": "BMW S1000RR is a race oriented sport bike initially made by BMW Motorrad to compete in the 2009 Superbike World Championship, that is now in commercial production. It was introduced in Munich in April 2008, and is powered by a 999 cc (61.0 cu in) four-cylinder engine redlined at 14,200 rpm. BMW made 1,000 S1000RRs in 2009 to satisfy World Superbike homologation requirements, but expanded production for commercial sale of the bike in 2010. It has a standard anti-lock braking system, with an optional electronic traction control. As of 2016, it has a wet weight of 204 kg (450 lb), and produces 148.4 kW (199.0 hp; 201.8 PS) at 13,500 rpm. With 133.6 kW (179.2 hp; 181.6 PS) to the rear wheel, it was the most powerful motorcycle in the class on the dyno."
    },
    {
      "id": 3,
      "imgUrl": "https://motohouse.bg/wp-content/uploads/2024/03/NINJA_125_KAWASAKI_2024_LIME_GREEN_EBONY_MOTOHOUSE-300x300.jpg",
      "brand": "Kavazaki",
      "model": "Ninja® ZX™-6R ABS KRT",
      "year": 2024,
      "color": "Green",
      "description": "Race DNA and advanced technology is what the Ninja® family is known for. So it comes as no surprise that the Ninja® ZX™-6R supersport bike features the advanced technology and performance you expect from a Ninja. he Ninja® ZX™-6R supersport motorcycle features 4 integrated riding modes (Sport, Road, Rain, or Manual) that allow the rider to select the level of traction control and power to suit the current riding conditions. The 4.3-in all-digital TFT color instrumentation with smartphone connectivity gives the rider important information at a glance, as well as the convenience and safety of a hands-free smartphone connection."
    },
    {
      "id": 4,
      "imgUrl": "https://images.ctfassets.net/x7j9qwvpvr5s/44VVijspCKvE6idM0PKlyi/6f095c98e8c66b4d27d2c56d2fdce0f5/Model-Menu-MY20-Superleggera-V4.png",
      "brand": "Ducati",
      "model": "Panigale V4",
      "year": 2024,
      "color": "Red",
      "description": "The Ducati Panigale V4 is a sport bike with a 1,103 cc (67.3 cu in) desmodromic 90° V4 engine introduced by Ducati in 2018 as the successor to the V-twin engined 1299. A smaller engine displacement version complies with the Superbike category competition regulations which state 'Over 750 cc up to 1000 cc' for three and four cylinder 4-stroke engines. The name 'Panigale' comes from the small manufacturing town of Borgo Panigale. The Panigale V4 uses the new Desmosedici Stradale V4 engine, derived from the Desmosedici MotoGP racing engine."
    },
    {
      "id": 5,
      "imgUrl": "https://suzukicycles.com/-/media/project/cycles/images/products/motorcycles/gsx-8r/studio-gallery/blue/gsx800frqm4_ysf_right_2400x1500.png",
      "brand": "Suzuki",
      "model": "GSX-8R",
      "year": 2024,
      "color": "Blue",
      "description": "If you're a fan of sporty riding, and you've seen the current influx of mid-capacity sports bikes on the market, you'll know it's a truly brilliant time to be on two-wheels - with the introduction of this Suzuki GSX-8R, there has never been a better time for a rider who has a hankering for tucking in and unleashing their inner Joan Mir (of course, I have to note a Suzuki rider here). However that doesn't mean it's strictly an out-and-out sports bike. Notably, our esteemed pals at MCN held a recent group test consisting of all of the bikes in this category for 2024, and the Suzuki came out on top as the best - not necessarily as it's the quickest, or sportiest, but because it's the best at an all-round approach. We spent two weeks riding this GSX-8R to see just how good it is, and if this motor is best suited to the sporty GSX-R moniker that holds so much weight amongst sports bike fans - or is it just too well-rounded, and not aggressive enough?"
    },
    {
      "id": 6,
      "imgUrl": "https://i.pinimg.com/736x/85/a5/8e/85a58e44ce66bfe7601167ecf2b74673.jpg",
      "brand": "Yamaha",
      "model": "R6-0928",
      "year": 2018,
      "color": "Black",
      "description": "The Yamaha YZF-R6 is a sport bike, produced by Yamaha as a 600 class from 1999 to 2020. From 2021, production availability is limited to race-only specification in most global markets, causing race organisers to realign their engine eligibility criteria to encourage other manufacturers having larger than 600 cc displacements to enter road-race competition from 2022. Race organisers wanted to provide scope for alternative machinery to move away from established tradition of the Yamaha R6 being the dominant marque in Supersport racing."
    },
    {
      "id": 0.32912840802064913,
      "brand": "Indian",
      "imgUrl": "https://www.indianmoto.it/fileadmin/templates/model_24/nav-menu/intl/scout-1250/scout-bobber-limited-sunset.jpg",
      "model": "Scout bobber",
      "color": "Red",
      "year": 2017,
      "description": "The liquid-cooled, 1133cc, V-twin delivers punchy acceleration and the power to pass anyone, anywhere. Electronic fuel injection delivers class-leading horsepower and acceleration, while a responsive 6-speed transmission allows for sporty, aggressive riding."
    }
  ]
}
